#language: ru

Функционал: Ипотека





  Сценарий: Заявка на ипотеку



    Когда Выполнено наведение на Ипотека и выбор Ипотека на готовое жилье


    Тогда выполняется смена фрейма



    Когда Заполняется поле Стоимость недвижимости

    Тогда Проверяется изменение полей справа



    Когда Заполняется поле Первоначальный взнос

    Тогда Проверяется изменение полей справа

    Когда Заполняется поле Срок

    Тогда Проверяется изменение полей справа

    Когда Выключаю зарплатныю карту Сбербанка

    Тогда Проверяется изменение полей справа

    Когда Выключаю возможность подтверждения

    Тогда Проверяется изменение полей справа

    Когда Включаю молодую семью

    Тогда Проверяется изменение полей справа
    Когда Включаю возможность подтвердить доход
    Тогда Итоговая проверка по всем пунктам справа
